ankuns/nrfx/bsp/stable/mdk/nrf7140_flpr.svd
        <register>
          <name>HCFG</name>
          <description>Host Configuration Register</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FSLSPCLKSEL</name>
              <description>FS/LS PHY Clock Select (FSLSPclkSel)</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK3060</name>
                  <description>PHY clock is running at 30/60 MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK48</name>
                  <description>PHY clock is running at 48 MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK6</name>
                  <description>PHY clock is running at 6 MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSLSSUPP</name>
              <description>FS- and LS-Only Support (FSLSSupp)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSFSLS</name>
                  <description>HS/FS/LS, based on the maximum speed supported by the connected device</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSLS</name>
                  <description>FS/LS-only, even if the connected device can support HS</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA32KHZS</name>
              <description>Enable 32 KHz Suspend mode (Ena32KHzS)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>32 KHz Suspend mode disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>32 KHz Suspend mode enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESVALID</name>
              <description>Resume Validation Period  (ResValid)</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>MODECHTIMEN</name>
              <description>Mode Change Ready Timer Enable (ModeChTimEn)</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The Host core waits for either 200 PHY clock cycles or a linestate of SE0 at the end of resume to change the opmode from 0x2 to 0x0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The Host core waits only for a linestate of SE0 at the end of resume to change the opmode from 0x2 to 0x0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFIR</name>
          <description>Host Frame Interval Register</description>
          <addressOffset>0x404</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000EA60</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRINT</name>
              <description>Frame Interval (FrInt)</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>HFIRRLDCTRL</name>
              <description>Reload Control (HFIRRldCtrl)</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The HFIR cannot be reloaded dynamically</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The HFIR can be dynamically reloaded during runtime</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFNUM</name>
          <description>Host Frame Number/Frame Time Remaining Register</description>
          <addressOffset>0x408</addressOffset>
          <access>read-write</access>
          <resetValue>0x00003FFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRNUM</name>
              <description>Frame Number (FrNum)</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No SOF is transmitted</description>
                  <value>0x0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>SOF is transmitted</description>
                  <value>0x0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRREM</name>
              <description>Frame Time Remaining (FrRem)</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HAINT</name>
          <description>Host All Channels Interrupt Register</description>
          <addressOffset>0x414</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HAINT</name>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Not active</description>
                  <value>0x0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Host Channel Interrupt</description>
                  <value>0x0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HAINTMSK</name>
          <description>Host All Channels Interrupt Mask Register</description>
          <addressOffset>0x418</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HAINTMSK</name>
              <description>Channel Interrupt Mask (HAINTMsk)</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNMASK</name>
                  <description>Unmask Channel interrupt</description>
                  <value>0x0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask Channel interrupt</description>
                  <value>0x0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HPRT</name>
          <description>Host Port Control and Status Register</description>
          <addressOffset>0x440</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRTCONNSTS</name>
              <description>Port Connect Status (PrtConnSts)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTATTACHED</name>
                  <description>No device is attached to the port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATTACHED</name>
                  <description>A device is attached to the port</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRTCONNDET</name>
              <description>Port Connect Detected (PrtConnDet)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No device connection detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Device connection detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRTENA</name>
              <description>Port Enable (PrtEna)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Port disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Port enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRTENCHNG</name>
              <description>Port Enable/Disable Change (PrtEnChng)</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Port Enable bit 2 has not changed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Port Enable bit 2 changed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRTOVRCURRACT</name>
              <description>Port Overcurrent Active (PrtOvrCurrAct)</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No overcurrent condition</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Overcurrent condition</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRTOVRCURRCHNG</name>
              <description>Port Overcurrent Change (PrtOvrCurrChng)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Status of port overcurrent status is not changed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Status of port overcurrent changed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRTRES</name>
              <description>Port Resume (PrtRes)</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORESUME</name>
                  <description>No resume driven</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESUME</name>
                  <description>Resume driven</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRTSUSP</name>
              <description>Port Suspend (PrtSusp)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Port not in Suspend mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Port in Suspend mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRTRST</name>
              <description>Port Reset (PrtRst)</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Port not in reset</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Port in reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRTLNSTS</name>
              <description>Port Line Status (PrtLnSts)</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLUSD</name>
                  <description>Logic level of D+</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUSD</name>
                  <description>Logic level of D-</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRTPWR</name>
              <description>Port Power (PrtPwr)</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Power off</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Power on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRTTSTCTL</name>
              <description>Port Test Control (PrtTstCtl)</description>
              <lsb>13</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Test mode disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TESTJ</name>
                  <description>Test_J mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TESTK</name>
                  <description>Test_K mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TESTSN</name>
                  <description>Test_SE0_NAK mode</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TESTPM</name>
                  <description>Test_Packet mode</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TESTFENB</name>
                  <description>Test_force_Enable</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRTSPD</name>
              <description>Port Speed (PrtSpd)</description>
              <lsb>17</lsb>
              <msb>18</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGHSPD</name>
                  <description>High speed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULLSPD</name>
                  <description>Full speed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWSPD</name>
                  <description>Low speed</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
