ankuns/nrfx/bsp/stable/mdk/nrf7140_flpr.svd
          <register>
            <name>TCFG</name>
            <description>Test mode configuration</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VREFTIMERREQ</name>
                <description>Controls VREF_TIMER_REQ_SW_1V8</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>RFRENDCRITERIA</name>
                <description>Controls RFR_END_CRITERIA_REQ_SW_1V8</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>LPCANCELREQ</name>
                <description>Controls LDP_LP_CANCEL_REQ_AO_1V8</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>MODELPREQ</name>
                <description>Controls MODE_LP_REQ_SW_1V8</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>MODEULPRREQ</name>
                <description>Controls MODE_ULPR_REQ_SW_1V8</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PWRUPIBPP</name>
                <description>Controls PWRUP_IBPP_BIAS_SW_1V8</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>PWRUPLP</name>
                <description>Controls PWRUP_LDO_LP_AO_1V8</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>PWRUPHP</name>
                <description>Controls PWRUP_LDO_HP_AO_1V8</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>PWRUPIBPSR</name>
                <description>Controls PWRUP_IBPSR_BIAS_SW_1V8</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>TCFGENABLE</name>
                <description>Enable TCFG control</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>REFRESHCMPCLK</name>
                <description>Controls clock input of refresh comparator</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CALEN</name>
            <description>Calibration enable</description>
            <addressOffset>0x34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CALEN</name>
                <description>Calibration enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ATCMPOff</name>
                    <description>ATCMP Off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATCMPOn</name>
                    <description>ATCMP ON</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CALCMP</name>
            <description>Calibration compare</description>
            <addressOffset>0x38</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CALCMP</name>
                <description>Calibration compare</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PCGCSLAVE</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_VREGVS0V8_PCGCSLAVE</headerStructName>
          <access>read-write</access>
          <addressOffset>0xF00</addressOffset>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PENALTY[%s]</name>
            <description>Description collection: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0] address overlaps the PENALTY0 address and register description for PENALTY[0] is not valid.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFC</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PENALTY</name>
                <description>Penalty level</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>FORCEOVERRIDE[%s]</name>
            <description>Description collection: Force override of power/clock pair n.</description>
            <addressOffset>0x80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLOCKFORCINGPRE</name>
                <description>CLOCKFORCINGPRE</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DOFORCECLOCKPRE</name>
                <description>DOFORCECLOCKPRE</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>POWERFORCINGPRE</name>
                <description>POWERFORCINGPRE</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>DOFORCEPOWERPRE</name>
                <description>DOFORCEPOWERPRE</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
        </cluster>
