ankuns/nrfx/bsp/stable/mdk/nrf7140_flpr.svd
          <register>
            <name>INTSTDATAID</name>
            <description>Interruption related with unrecognized or unimplemented data type detected in a specific virtual channel.</description>
            <addressOffset>0x2C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRIDVC0</name>
                <description>Unrecognized or unimplemented data type detected in virtual channel 0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRIDVC1</name>
                <description>Unrecognized or unimplemented data type detected in virtual channel 1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRIDVC2</name>
                <description>Unrecognized or unimplemented data type detected in virtual channel 2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRIDVC3</name>
                <description>Unrecognized or unimplemented data type detected in virtual channel 3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRIDVC4</name>
                <description>Unrecognized or unimplemented data type detected in virtual channel 4.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRIDVC5</name>
                <description>Unrecognized or unimplemented data type detected in virtual channel 5.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRIDVC6</name>
                <description>Unrecognized or unimplemented data type detected in virtual channel 6.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRIDVC7</name>
                <description>Unrecognized or unimplemented data type detected in virtual channel 7.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRIDVC8</name>
                <description>Unrecognized or unimplemented data type detected in virtual channel 8.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRIDVC9</name>
                <description>Unrecognized or unimplemented data type detected in virtual channel 9.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRIDVC10</name>
                <description>Unrecognized or unimplemented data type detected in virtual channel 10.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRIDVC11</name>
                <description>Unrecognized or unimplemented data type detected in virtual channel 11.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRIDVC12</name>
                <description>Unrecognized or unimplemented data type detected in virtual channel 12.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRIDVC13</name>
                <description>Unrecognized or unimplemented data type detected in virtual channel 13.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRIDVC14</name>
                <description>Unrecognized or unimplemented data type detected in virtual channel 14.</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRIDVC15</name>
                <description>Unrecognized or unimplemented data type detected in virtual channel 15.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTMSKDATAID</name>
            <description>Interrupt mask for INT_ST_DATA_ID  controls which interrupt status bits trigger the interrupt pin. Bit at 1 - Enable the interrupt source. Bit at 0 - Interrupt source is masked.</description>
            <addressOffset>0x2C4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRIDVC0</name>
                <description>Mask for err_id_vc0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ERRIDVC1</name>
                <description>Mask for err_id_vc1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ERRIDVC2</name>
                <description>Mask for err_id_vc2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ERRIDVC3</name>
                <description>Mask for err_id_vc3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ERRIDVC4</name>
                <description>Mask for err_id_vc4.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>ERRIDVC5</name>
                <description>Mask for err_id_vc5.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>ERRIDVC6</name>
                <description>Mask for err_id_vc6.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ERRIDVC7</name>
                <description>Mask for err_id_vc7.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>ERRIDVC8</name>
                <description>Mask for err_id_vc8.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>ERRIDVC9</name>
                <description>Mask for err_id_vc9.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>ERRIDVC10</name>
                <description>Mask for err_id_vc10.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>ERRIDVC11</name>
                <description>Mask for err_id_vc11.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>ERRIDVC12</name>
                <description>Mask for err_id_vc12.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>ERRIDVC13</name>
                <description>Mask for err_id_vc13.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>ERRIDVC14</name>
                <description>Mask for err_id_vc14.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>ERRIDVC15</name>
                <description>Mask for err_id_vc15.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTFORCEDATAID</name>
            <description>Interrupt force register is used for test purposes, and allows triggering INT_ST_DATA_ID  interrupt events individually. There is no need to activate the conditions that trigger the interrupt sources, because it may be extremely complex to generate stimuli for that purpose. This register is auto-clear.</description>
            <addressOffset>0x2C8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRIDVC0</name>
                <description>Force err_id_vc0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ERRIDVC1</name>
                <description>Force err_id_vc1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ERRIDVC2</name>
                <description>Force err_id_vc2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ERRIDVC3</name>
                <description>Force err_id_vc3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ERRIDVC4</name>
                <description>Force err_id_vc4.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>ERRIDVC5</name>
                <description>Force err_id_vc5.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>ERRIDVC6</name>
                <description>Force err_id_vc6.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ERRIDVC7</name>
                <description>Force err_id_vc7.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>ERRIDVC8</name>
                <description>Force err_id_vc8.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>ERRIDVC9</name>
                <description>Force err_id_vc9.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>ERRIDVC10</name>
                <description>Force err_id_vc10.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>ERRIDVC11</name>
                <description>Force err_id_vc11.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>ERRIDVC12</name>
                <description>Force err_id_vc12.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>ERRIDVC13</name>
                <description>Force err_id_vc13.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>ERRIDVC14</name>
                <description>Force err_id_vc14.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>ERRIDVC15</name>
                <description>Force err_id_vc15.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTSTECCCORRECTED</name>
            <description>Interruption related with header error detected and corrected for a specific virtual channel.</description>
            <addressOffset>0x2D0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRECCCORRECTEDVC0</name>
                <description>D-PHY mode: Header error detected and corrected on virtual channel 0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC1</name>
                <description>D-PHY mode: Header error detected and corrected on virtual channel 1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC2</name>
                <description>D-PHY mode: Header error detected and corrected on virtual channel 2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC3</name>
                <description>D-PHY mode: Header error detected and corrected on virtual channel 3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC4</name>
                <description>D-PHY mode: Header error detected and corrected on virtual channel 4.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC5</name>
                <description>D-PHY mode: Header error detected and corrected on virtual channel 5.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC6</name>
                <description>D-PHY mode: Header error detected and corrected on virtual channel 6.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC7</name>
                <description>D-PHY mode: Header error detected and corrected on virtual channel 7.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC8</name>
                <description>D-PHY mode: Header error detected and corrected on virtual channel 8.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC9</name>
                <description>D-PHY mode: Header error detected and corrected on virtual channel 9.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC10</name>
                <description>D-PHY mode: Header error detected and corrected on virtual channel 10.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC11</name>
                <description>D-PHY mode: Header error detected and corrected on virtual channel 11.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC12</name>
                <description>D-PHY mode: Header error detected and corrected on virtual channel 12.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC13</name>
                <description>D-PHY mode: Header error detected and corrected on virtual channel 13.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC14</name>
                <description>D-PHY mode: Header error detected and corrected on virtual channel 14.</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC15</name>
                <description>D-PHY mode: Header error detected and corrected on virtual channel 15.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTMSKECCCORRECTED</name>
            <description>Interrupt mask for INT_ST_ECC_CORRECTED  controls which interrupt status bits trigger the interrupt pin. Bit at 1 - Enable the interrupt source. Bit at 0 - Interrupt source is masked.</description>
            <addressOffset>0x2D4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRECCCORRECTEDVC0</name>
                <description>Mask for err_ecc_corrected_vc0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC1</name>
                <description>Mask for err_ecc_corrected_vc1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC2</name>
                <description>Mask for err_ecc_corrected_vc2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC3</name>
                <description>Mask for err_ecc_corrected_vc3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC4</name>
                <description>Mask for err_ecc_corrected_vc4.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC5</name>
                <description>Mask for err_ecc_corrected_vc5.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC6</name>
                <description>Mask for err_ecc_corrected_vc6.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC7</name>
                <description>Mask for err_ecc_corrected_vc7.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC8</name>
                <description>Mask for err_ecc_corrected_vc8.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC9</name>
                <description>Mask for err_ecc_corrected_vc9.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC10</name>
                <description>Mask for err_ecc_corrected_vc10.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC11</name>
                <description>Mask for err_ecc_corrected_vc11.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC12</name>
                <description>Mask for err_ecc_corrected_vc12.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC13</name>
                <description>Mask for err_ecc_corrected_vc13.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC14</name>
                <description>Mask for err_ecc_corrected_vc14.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC15</name>
                <description>Mask for err_ecc_corrected_vc15.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
