ankuns/nrfx/bsp/stable/mdk/nrf7140_flpr.svd
          <register>
            <name>INTFORCEECCCORRECTED</name>
            <description>Interrupt force register is used for test purposes, and allows triggering INT_ST_ECC_CORRECTED  interrupt events individually. There is no need to activate the conditions that trigger the interrupt sources, because it may be extremely complex to generate stimuli for that purpose. This register is auto-clear.</description>
            <addressOffset>0x2D8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRECCCORRECTEDVC0</name>
                <description>Force err_ecc_corrected_vc0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC1</name>
                <description>Force err_ecc_corrected_vc1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC2</name>
                <description>Force err_ecc_corrected_vc2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC3</name>
                <description>Force err_ecc_corrected_vc3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC4</name>
                <description>Force err_ecc_corrected_vc4.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC5</name>
                <description>Force err_ecc_corrected_vc5.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC6</name>
                <description>Force err_ecc_corrected_vc6.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC7</name>
                <description>Force err_ecc_corrected_vc7.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC8</name>
                <description>Force err_ecc_corrected_vc8.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC9</name>
                <description>Force err_ecc_corrected_vc9.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC10</name>
                <description>Force err_ecc_corrected_vc10.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC11</name>
                <description>Force err_ecc_corrected_vc11.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC12</name>
                <description>Force err_ecc_corrected_vc12.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC13</name>
                <description>Force err_ecc_corrected_vc13.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC14</name>
                <description>Force err_ecc_corrected_vc14.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>ERRECCCORRECTEDVC15</name>
                <description>Force err_ecc_corrected_vc15.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SCRAMBLING</name>
            <description>This register configures the De-scrambler block.</description>
            <addressOffset>0x300</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCRAMBLEENABLE</name>
                <description>Enables data de-scrambling on the controller side.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SCRAMBLINGSEED1</name>
            <description>This register configures the seed used by De-scrambler block for lane 1</description>
            <addressOffset>0x304</addressOffset>
            <access>read-write</access>
            <resetValue>0x00001008</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCRAMBLESEEDLANE1</name>
                <description>Seed used by De-scrambler block for lane 1</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SCRAMBLINGSEED2</name>
            <description>This register configures the seed used by De-scrambler block for lane 2</description>
            <addressOffset>0x308</addressOffset>
            <access>read-write</access>
            <resetValue>0x00001188</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCRAMBLESEEDLANE2</name>
                <description>Seed used by De-scrambler block for lane 2</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
        </cluster>
