ankuns/nrfx/bsp/stable/mdk/nrf7140_flpr.svd
          <register>
            <name>GPIO</name>
            <description>General Purpose register.</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RDWRGPIO</name>
                <description>Read/Write from/to GPIO pins</description>
                <lsb>0</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>POS13LEN02</name>
                <lsb>13</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>DPISHUTDOWN</name>
                <description>Assert DPI-2 Shutdown Signal</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>DPICOLORMODE</name>
                <description>Assert DPI-2 Color Mode Signal</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>POS17LEN15</name>
                <lsb>17</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER0MODE</name>
            <description>Activate and set-up layer 0</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>POS25LEN7</name>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>LAYERREGPROTECT</name>
                <description>Enable Register Protection for NemaDC layer registers.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>FLIPXEN</name>
                <description>Enables the FlipX functionality.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>FLIPYEN</name>
                <description>Enables the FlipY functionality</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>SRCBLEND</name>
                <description>Source blending function for layer 0.</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>DSTBLEND</name>
                <description>Destination blending function for layer 0.</description>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GLBALPHA</name>
                <description>Alpha layer global value (0x00-0xFF range)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>POS24LEN02</name>
                <lsb>24</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>GAMMAEN</name>
                <description>When set to 1, Gamma Look Up Table is enabled</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>POS27LEN01</name>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>PREMULT</name>
                <description>When set to 1, premultiply image alpha is enabled</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>DISUNDERFLOWPREVENTION</name>
                <description>When set to 1, it disables the mechanism that prevent the underflow</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>FORCEALPHA</name>
                <description>When set to 1, force alpha with global alpha</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>LAYEREN</name>
                <description>When set to 1, layer n is enabled</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER0STARTXY</name>
            <description>X and Y start dimensions of layer 0</description>
            <addressOffset>0x034</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STARTY</name>
                <description>Specify the pixel offset of the starting Y dimension of layer 0</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>STARTX</name>
                <description>Specify the pixel offset of the starting X dimension of layer 0</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER0SIZEXY</name>
            <description>X and Y size of layer 0</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SIZEY</name>
                <description>Specify the pixel size of the layer 0 in the Y dimension</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>SIZEX</name>
                <description>Specify the pixel size of the layer 0 in the X dimension</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER0BASEADDR</name>
            <description>The start address of the framebuffer to be accessed by layer 0</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BASEADDR</name>
                <description>Specify the start address of framebuffer for layer 0.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER0STRIDE</name>
            <description>Specify the stride and the AXI bus burst of layer 0</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STRIDE</name>
                <description>Specify the stride, which is the distance from line to line in bytes for layer 0 memory</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>AXIBEAT</name>
                <description>Specify the AXI-beats per burst in layer 0</description>
                <lsb>16</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>AXITHRESHOLD</name>
                <description>Specify the AXI fifo threshold burst start in layer 0</description>
                <lsb>19</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>POS21LEN4</name>
                <lsb>21</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>POS25LEN7</name>
                <lsb>25</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER0RESXY</name>
            <description>X and Y start dimensions of layerX and Y dimensions for the resolution of layer 0.</description>
            <addressOffset>0x044</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESY</name>
                <description>Specify the layer 0 pixel resolution in the Y dimension</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>RESX</name>
                <description>Specify the layer 0 pixel resolution in the X dimension</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER1MODE</name>
            <description>Activate and set-up layer 1</description>
            <addressOffset>0x050</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>POS25LEN7</name>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>LAYERREGPROTECT</name>
                <description>Enable Register Protection for NemaDC layer registers.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>FLIPXEN</name>
                <description>Enables the FlipX functionality.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>FLIPYEN</name>
                <description>Enables the FlipY functionality</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>SRCBLEND</name>
                <description>Source blending function for layer 1.</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>DSTBLEND</name>
                <description>Destination blending function for layer 1.</description>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GLBALPHA</name>
                <description>Alpha layer global value (0x00-0xFF range)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>POS24LEN02</name>
                <lsb>24</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>GAMMAEN</name>
                <description>When set to 1, Gamma Look Up Table is enabled</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>POS27LEN01</name>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>PREMULT</name>
                <description>When set to 1, premultiply image alpha is enabled</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>DISUNDERFLOWPREVENTION</name>
                <description>When set to 1, it disables the mechanism that prevent the underflow</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>FORCEALPHA</name>
                <description>When set to 1, force alpha with global alpha</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>LAYEREN</name>
                <description>When set to 1, layer n is enabled</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER1STARTXY</name>
            <description>X and Y start dimensions of layer 1</description>
            <addressOffset>0x054</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STARTY</name>
                <description>Specify the pixel offset of the starting Y dimension of layer 1</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>STARTX</name>
                <description>Specify the pixel offset of the starting X dimension of layer 1</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER1SIZEXY</name>
            <description>X and Y size of layer 1</description>
            <addressOffset>0x058</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SIZEY</name>
                <description>Specify the pixel size of the layer 1 in the Y dimension</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>SIZEX</name>
                <description>Specify the pixel size of the layer 1 in the X dimension</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER1BASEADDR</name>
            <description>The start address of the framebuffer to be accessed by layer 1</description>
            <addressOffset>0x05C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BASEADDR</name>
                <description>Specify the start address of framebuffer for layer 1.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER1STRIDE</name>
            <description>Specify the stride and the AXI bus burst of layer 1</description>
            <addressOffset>0x060</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STRIDE</name>
                <description>Specify the stride, which is the distance from line to line in bytes for layer 1 memory</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>AXIBEAT</name>
                <description>Specify the AXI-beats per burst in layer 1</description>
                <lsb>16</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>AXITHRESHOLD</name>
                <description>Specify the AXI fifo threshold burst start in layer 1</description>
                <lsb>19</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>POS21LEN4</name>
                <lsb>21</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>POS25LEN7</name>
                <lsb>25</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER1RESXY</name>
            <description>X and Y start dimensions of layerX and Y dimensions for the resolution of layer 1.</description>
            <addressOffset>0x064</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESY</name>
                <description>Specify the layer 1 pixel resolution in the Y dimension</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>RESX</name>
                <description>Specify the layer 1 pixel resolution in the X dimension</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER2MODE</name>
            <description>Activate and set-up layer 2</description>
            <addressOffset>0x070</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>POS25LEN7</name>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>LAYERREGPROTECT</name>
                <description>Enable Register Protection for NemaDC layer registers.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>FLIPXEN</name>
                <description>Enables the FlipX functionality.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>FLIPYEN</name>
                <description>Enables the FlipY functionality</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>SRCBLEND</name>
                <description>Source blending function for layer 2.</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>DSTBLEND</name>
                <description>Destination blending function for layer 2.</description>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GLBALPHA</name>
                <description>Alpha layer global value (0x00-0xFF range)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>POS24LEN02</name>
                <lsb>24</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>GAMMAEN</name>
                <description>When set to 1, Gamma Look Up Table is enabled</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>POS27LEN01</name>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>PREMULT</name>
                <description>When set to 1, premultiply image alpha is enabled</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>DISUNDERFLOWPREVENTION</name>
                <description>When set to 1, it disables the mechanism that prevent the underflow</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>FORCEALPHA</name>
                <description>When set to 1, force alpha with global alpha</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>LAYEREN</name>
                <description>When set to 1, layer n is enabled</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER2STARTXY</name>
            <description>X and Y start dimensions of layer 2</description>
            <addressOffset>0x074</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STARTY</name>
                <description>Specify the pixel offset of the starting Y dimension of layer 2</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>STARTX</name>
                <description>Specify the pixel offset of the starting X dimension of layer 2</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER2SIZEXY</name>
            <description>X and Y size of layer 2</description>
            <addressOffset>0x078</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SIZEY</name>
                <description>Specify the pixel size of the layer 2 in the Y dimension</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>SIZEX</name>
                <description>Specify the pixel size of the layer 2 in the X dimension</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER2BASEADDR</name>
            <description>The start address of the framebuffer to be accessed by layer 2</description>
            <addressOffset>0x07C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BASEADDR</name>
                <description>Specify the start address of framebuffer for layer 2.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
