ankuns/nrfx/bsp/stable/mdk/nrf7140_flpr.svd
          <register>
            <name>LAYER2STRIDE</name>
            <description>Specify the stride and the AXI bus burst of layer 2</description>
            <addressOffset>0x080</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STRIDE</name>
                <description>Specify the stride, which is the distance from line to line in bytes for layer 2 memory</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>AXIBEAT</name>
                <description>Specify the AXI-beats per burst in layer 2</description>
                <lsb>16</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>AXITHRESHOLD</name>
                <description>Specify the AXI fifo threshold burst start in layer 2</description>
                <lsb>19</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>POS21LEN4</name>
                <lsb>21</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>POS25LEN7</name>
                <lsb>25</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER2RESXY</name>
            <description>X and Y start dimensions of layerX and Y dimensions for the resolution of layer 2.</description>
            <addressOffset>0x084</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESY</name>
                <description>Specify the layer 2 pixel resolution in the Y dimension</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>RESX</name>
                <description>Specify the layer 2 pixel resolution in the X dimension</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER3MODE</name>
            <description>Activate and set-up layer 3</description>
            <addressOffset>0x090</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>POS25LEN7</name>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>LAYERREGPROTECT</name>
                <description>Enable Register Protection for NemaDC layer registers.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>FLIPXEN</name>
                <description>Enables the FlipX functionality.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>FLIPYEN</name>
                <description>Enables the FlipY functionality</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>SRCBLEND</name>
                <description>Source blending function for layer 3.</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>DSTBLEND</name>
                <description>Destination blending function for layer 3.</description>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GLBALPHA</name>
                <description>Alpha layer global value (0x00-0xFF range)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>POS24LEN02</name>
                <lsb>24</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>GAMMAEN</name>
                <description>When set to 1, Gamma Look Up Table is enabled</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>POS27LEN01</name>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>PREMULT</name>
                <description>When set to 1, premultiply image alpha is enabled</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>DISUNDERFLOWPREVENTION</name>
                <description>When set to 1, it disables the mechanism that prevent the underflow</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>FORCEALPHA</name>
                <description>When set to 1, force alpha with global alpha</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>LAYEREN</name>
                <description>When set to 1, layer n is enabled</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER3STARTXY</name>
            <description>X and Y start dimensions of layer 3</description>
            <addressOffset>0x094</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STARTY</name>
                <description>Specify the pixel offset of the starting Y dimension of layer 3</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>STARTX</name>
                <description>Specify the pixel offset of the starting X dimension of layer 3</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER3SIZEXY</name>
            <description>X and Y size of layer 3</description>
            <addressOffset>0x098</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SIZEY</name>
                <description>Specify the pixel size of the layer 3 in the Y dimension</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>SIZEX</name>
                <description>Specify the pixel size of the layer 3 in the X dimension</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER3BASEADDR</name>
            <description>The start address of the framebuffer to be accessed by layer 3</description>
            <addressOffset>0x09C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BASEADDR</name>
                <description>Specify the start address of framebuffer for layer 3.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER3STRIDE</name>
            <description>Specify the stride and the AXI bus burst of layer 3</description>
            <addressOffset>0x0A0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STRIDE</name>
                <description>Specify the stride, which is the distance from line to line in bytes for layer 3 memory</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>AXIBEAT</name>
                <description>Specify the AXI-beats per burst in layer 3</description>
                <lsb>16</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>AXITHRESHOLD</name>
                <description>Specify the AXI fifo threshold burst start in layer 3</description>
                <lsb>19</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>POS21LEN4</name>
                <lsb>21</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>POS25LEN7</name>
                <lsb>25</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER3RESXY</name>
            <description>X and Y start dimensions of layerX and Y dimensions for the resolution of layer 3.</description>
            <addressOffset>0x0A4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESY</name>
                <description>Specify the layer 3 pixel resolution in the Y dimension</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>RESX</name>
                <description>Specify the layer 3 pixel resolution in the X dimension</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTERFACECMD</name>
            <description>Command Register to read/write commands from/to DBI Type-B/SPI interfaces.</description>
            <addressOffset>0x0E8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INTERFACEDATA</name>
                <description>Data to send to the DBI Type-B/SPI interfaces</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>SCANLINECMD</name>
                <description>When sets to 1, store internally a command type which is</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>DBIBSUPPORTSIGNALS</name>
                <description>When sets to 1, NEMADC_REG_FORMAT_CTRL[15:8] is exposed on DBIB_CT pins and</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>READMODE</name>
                <description>When sets to 1, read mode is enabled</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>SERIALCMD</name>
                <description>When sets to 1, switch to serial transmission of the</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>CMDWIDTH</name>
                <description>Determine the command width.</description>
                <lsb>28</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>DATACMD</name>
                <description>Send direct data of type 'command' to the DBI Type-B/SPI interfaces</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>BASEADDRESSCMD</name>
                <description>When set to 0, indicates that the command data are</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTERFACERDAT</name>
            <description>Data read by DBI Type-B/SPI interfaces are stored in the NEMADC_REG_INTERFACE_RDAT register.</description>
            <addressOffset>0x0EC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>READDATA</name>
                <description>Read data from DBI Type-B/SPI interfaces (low bits)</description>
                <lsb>0</lsb>
                <msb>29</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>READCYCLES</name>
                <description>On Write: Specify the number of read cycles for SPI</description>
                <lsb>30</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>Information register of the layers activation and setup.</description>
            <addressOffset>0x0F0</addressOffset>
            <access>read-write</access>
            <resetValue>0x1100095B</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GLOBALPALETTE</name>
                <description>Indicates that Global Gamma/Palette is enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CURSOREN</name>
                <description>Indicates that cursor is enabled</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>POS02LEN01</name>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DITHEREN</name>
                <description>Indicates that dithering is enabled</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>FORMATEN</name>
                <description>Indicates that formatting is enabled</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>POS05LEN01</name>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBIBEN</name>
                <description>Indicates that DBI Type-B interface is enabled</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RGB2YUVEN</name>
                <description>Indicates that RGB to YUV/YCbCr converter is enabled</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER0EN</name>
                <description>Indicates that layer 0 is enabled</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER0BLENDEN</name>
                <description>Indicates that layer 0 has blender</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>POS10LEN01</name>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER0GAMMAEN</name>
                <description>Indicates that layer 0 has gamma LUT</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER1EN</name>
                <description>Indicates that layer 1 is enabled</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER1BLENDEN</name>
                <description>Indicates that layer 1 has blender</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>POS14LEN01</name>
                <lsb>14</lsb>
                <msb>14</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER1GAMMAEN</name>
                <description>Indicates that layer 1 has gamma LUT</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER2EN</name>
                <description>Indicates that layer 2 is enabled</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER2BLENDEN</name>
                <description>Indicates that layer 2 has blender</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>POS18LEN01</name>
                <lsb>18</lsb>
                <msb>18</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER2GAMMAEN</name>
                <description>Indicates that layer 2 has gamma LUT</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER3EN</name>
                <description>Indicates that layer 3 is enabled</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER3BLENDEN</name>
                <description>Indicates that layer 3 has blender</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>POS22LEN01</name>
                <lsb>22</lsb>
                <msb>22</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER3GAMMAEN</name>
                <description>Indicates that layer 3 has gamma LUT</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SPIEN</name>
                <description>Indicates that SPI interface is enabled</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>POS24LEN04</name>
                <lsb>25</lsb>
                <msb>27</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER0TSCMEMEN</name>
                <description>Indicates that layer 0 has TSC Memory</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER1TSCMEMEN</name>
                <description>Indicates that layer 1 has TSC Memory</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER2TSCMEMEN</name>
                <description>Indicates that layer 2 has TSC Memory</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER3TSCMEMEN</name>
                <description>Indicates that layer 3 has TSC Memory</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IDREG</name>
            <description>Identification Register.</description>
            <addressOffset>0x0F4</addressOffset>
            <access>read-write</access>
            <resetValue>0x87452365</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IDREG</name>
                <description>Constant ID value</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
