ankuns/nrfx/bsp/stable/mdk/nrf7140_flpr.svd
          <register>
            <name>GAMMALUT0134</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1218</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0135</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x121C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0136</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1220</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0137</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1224</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0138</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1228</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0139</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x122C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0140</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1230</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0141</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1234</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0142</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1238</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0143</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x123C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0144</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1240</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0145</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1244</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0146</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1248</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0147</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x124C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0148</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1250</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0149</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1254</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
