ankuns/nrfx/bsp/stable/mdk/nrf7140_flpr.svd
        <register>
          <name>SHUNTALGCONFIG</name>
          <description>Configuration settings for Shunt regulator algorithm</description>
          <addressOffset>0x6AC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00004482</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RSTPULSEWIDTH</name>
              <description>Pulse width of peak reset signal</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>RSTPPEAKPERIOD</name>
              <description>Period of peak reset signal</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>MULTTRIMSTARTVALUE</name>
              <description>Start value for MULT_TRIM</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>MULTTRIMLOVWERBOUND</name>
              <description>Lower bound on MULT_TRIM</description>
              <lsb>12</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>DISABLESHUNT</name>
              <description>Control shunt regulation during load modulation</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Shunt regulation is disabled during load modulation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Shunt regulation is enabled during load modulation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALPWRUPNFCTFIELDDET</name>
          <description>Power up field detect part of circuit and 5 nA IBPP current reference</description>
          <addressOffset>0x6B8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVRVALPWRUPNFCTFIELDDET</name>
              <description>Power up field detect part of circuit and 5 nA IBPP current reference</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALNFCTRSTEDCLK</name>
          <description>Resets edge detect signal in NFCT_CLOCKREC_GF22N</description>
          <addressOffset>0x6BC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVRVALNFCTRSTEDCLK</name>
              <description>Resets edge detect signal in NFCT_CLOCKREC_GF22N</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALNFCTRSTPEAKLEV</name>
          <description>Resets peak detectors in NFCT_SHUNTREG_GF22N</description>
          <addressOffset>0x6C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVRVALNFCTRSTPEAKLEV</name>
              <description>Resets peak detectors in NFCT_SHUNTREG_GF22N</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALNFCTCALEN</name>
          <description>Enable calibration of ring oscillator in NFCT_CLOCKREC_GF22N</description>
          <addressOffset>0x6C4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVRVALNFCTCALEN</name>
              <description>Enable calibration of ring oscillator in NFCT_CLOCKREC_GF22N</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NFCTFIELDDETCFG</name>
          <description>NFCT_FIELDDET_GF22N configuration bits</description>
          <addressOffset>0x6C8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>THRESHOLDVOLTAGE</name>
              <description>Trimming of field detector threshold voltage</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>HYSTERESISLEVEL</name>
              <description>Change hysteresis level of internal comparator</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>TRIMIBPP</name>
              <description>Trim 5 nA IBPP current (from NFCT_BIAS_GF22N)</description>
              <lsb>8</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NFCTCTRL</name>
          <description>Spare digital control signals</description>
          <addressOffset>0x6CC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DIGITALCONTROL</name>
              <description>Spare digital control signals</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRUPNFCTLDO</name>
          <description>Power-up for LDO</description>
          <addressOffset>0x6D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>POWERBLEEDCURRENT</name>
              <description>Power-up with bleed current</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>POWERNOBLEEDCURRENT</name>
              <description>Power-up without bleed current</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PADCONFIG</name>
          <description>NFC pad configuration</description>
          <addressOffset>0x6D4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable NFC pads</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>NFC pads are used as GPIO pins</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The NFC pads are configured as NFC antenna pins</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NFCTCALCMP</name>
          <description>Output from the calibration comparator</description>
          <addressOffset>0x6E0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>NFCTCALCMP</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NFCCaLCmpLow</name>
                  <description>Trim code low</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NFCCaLCmpHigh</name>
                  <description>Trim code high</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BIASCFG</name>
          <description>Configuration of NFCT_BIAS_GF22N</description>
          <addressOffset>0x6E4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00007000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIMIBPSR</name>
              <description>Fine trim IBPSR 4 uA bias current This will also trim VREF_SWAT_0V8 in steps of 10 mV</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>COARSEIBPSR</name>
              <description>Coarse IBPSR 4 uA. Might be needed to cover trimming range if modelling is an issue</description>
              <lsb>8</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>REFERENCEVOLTAGE</name>
              <description>Reference voltage level</description>
              <lsb>12</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>SPARE</name>
              <description>Spare</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RINGOSCCONFIG</name>
          <description>Configuration settings for ring oscillator algorithm</description>
          <addressOffset>0x6E8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALIBRATIONSOURCE</name>
              <description>Calibration source</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>NFC carrier signal used as calibration source</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>16 MHz crystal oscillator used as calibration source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALRETAIN</name>
          <description>Retain - Latch and isolate all RET_0V8 inputs to NFCT_ANA_GF22N and P_NFC_GF22N</description>
          <addressOffset>0x6EC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVRVALRETAIN</name>
              <description>Retain - Latch and isolate all RET_0V8 inputs to NFCT_ANA_GF22N and P_NFC_GF22N</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CMFBENABLE</name>
          <description>Enable calibration of cmfbPdRef</description>
          <addressOffset>0x6F0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CMFBENABLE</name>
              <description>Enable calibration of cmfbPdRef</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALPADNFCCFG</name>
          <description>Override of P_NFCCFG_RET_0V8 to P_NFC_GF22N</description>
          <addressOffset>0x6F4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMMONREGEN</name>
              <description>Enable/disable common-regulation at pad</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>COMMONMODEVOLT</name>
              <description>Set common-mode voltage level at pad</description>
              <lsb>1</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>SHUNTREGSHUNT</name>
              <description>Multiplier of shunt transistor between NFC1 and NFC2 during shunt regulation</description>
              <lsb>4</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>SHUNTTRANSISTORS</name>
              <description>Gate voltage of shunt transistors</description>
              <lsb>11</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>SHUNTREGLOAD</name>
              <description>Multiplier of shunt transistor between NFC1 and NFC2 during load modulation</description>
              <lsb>16</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>BULKBIAS</name>
              <description>Enable/disable bulk bias of shunt transistors (flipped-well devices) during load modulation</description>
              <lsb>23</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>GATEVOLTAGECLAMP</name>
              <description>Back gate voltage of clamp during 2.6 V clamping mode</description>
              <lsb>24</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>DFT</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_NFCT_DFT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>ATB0CONFIG</name>
            <description>Analog Test Bus 0 (ATB0) configuration</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SELMUX</name>
                <description>Select multiplexer for ATB0</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HighZ</name>
                    <description>High impudence</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BiasCurr8uA</name>
                    <description>8 uA bias current from NFCT_BIAS_GF22N</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BiasCurr50nA</name>
                    <description>50 nA bias current from NFCT_BIAS_GF22N</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ConnectATB0ToCalib</name>
                    <description>Connect ATB0 to inverting input of calibration comparator in NFCT_BIAS_GF22N.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare0</name>
                    <description>Spare pin (High impudence).</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare1</name>
                    <description>Spare pin (High impudence).</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare2</name>
                    <description>Spare pin (High impudence).</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare3</name>
                    <description>Spare pin (High impudence).</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the analog test bus</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Analog test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Analog test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ATB1CONFIG</name>
            <description>Analog Test Bus 1 (ATB1) configuration</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SELMUX</name>
                <description>Select multiplexer for ATB1</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HighZ</name>
                    <description>High impudence</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NFCTLDOOut</name>
                    <description>Output voltage from NFCT_LDO_GF22N</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VCOTuningVolt</name>
                    <description>VCO tuning voltage from NFCT_CLOCKREC_GF22N</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare0</name>
                    <description>Spare pin</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare1</name>
                    <description>Spare pin</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare2</name>
                    <description>Spare pin</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare3</name>
                    <description>Spare pin</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare4</name>
                    <description>Spare pin</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare5</name>
                    <description>Spare pin (ATB buffer enabled)</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SWATRefVolt</name>
                    <description>SWAT reference voltage from NFCT_BIAS_GF22N (ATB buffer enabled)</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BackGateVolt</name>
                    <description>Back-gate voltage from envelope detector in NFCT_SHUNTREG_GF22N (ATB buffer enabled)</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HighThrPeakDet</name>
                    <description>High threshold voltage for peak detector in NFCT_SHUNTREG_GF22N (ATB buffer enabled)</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LowThrPeakDet</name>
                    <description>Low threshold voltage for peak detector in NFCT_SHUNTREG_GF22N (ATB buffer enabled)</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CommomModeEnvDet</name>
                    <description>Common-mode for envelope detector in NFCT_SHUNTREG_GF22N (ATB buffer enabled)</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NFCEnv</name>
                    <description>Extracted NFC envelope from NFCT_SHUNTREG_GF22N)</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare6</name>
                    <description>Spare pin (ATB buffer enabled)</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the analog test bus</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Analog test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Analog test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
