ankuns/nrfx/bsp/stable/mdk/nrf7140_flpr.svd
            <register>
              <dim>0x4</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>FORCEOVERRIDE[%s]</name>
              <description>Description collection: Force override of power/clock pair n.</description>
              <addressOffset>0x80</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CLOCKFORCINGPRE</name>
                  <description>CLOCKFORCINGPRE</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>DOFORCECLOCKPRE</name>
                  <description>DOFORCECLOCKPRE</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>POWERFORCINGPRE</name>
                  <description>POWERFORCINGPRE</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                </field>
                <field>
                  <name>DOFORCEPOWERPRE</name>
                  <description>DOFORCEPOWERPRE</description>
                  <lsb>15</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>BRGMCK</name>
            <description>Unspecified</description>
            <headerStructName>TDM_PCGCS_BRGMCK</headerStructName>
            <access>read-write</access>
            <addressOffset>0x100</addressOffset>
            <register>
              <dim>0x3</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>PENALTY[%s]</name>
              <description>Description collection: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0] address overlaps the PENALTY0 address and register description for PENALTY[0] is not valid.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFC</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PENALTY</name>
                  <description>Penalty level</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PENALTY0</name>
              <description>Penalty level for power/clock pair 0. The register description is valid only when FULL_PCP_ZERO feature is not supported</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <alternateRegister>PENALTY[%s]</alternateRegister>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PENALTY</name>
                  <description>Penalty level</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x3</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>FORCEOVERRIDE[%s]</name>
              <description>Description collection: Force override of power/clock pair n.</description>
              <addressOffset>0x80</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CLOCKFORCINGPRE</name>
                  <description>CLOCKFORCINGPRE</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>DOFORCECLOCKPRE</name>
                  <description>DOFORCECLOCKPRE</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>POWERFORCINGPRE</name>
                  <description>POWERFORCINGPRE</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                </field>
                <field>
                  <name>DOFORCEPOWERPRE</name>
                  <description>DOFORCEPOWERPRE</description>
                  <lsb>15</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>BRGSCK</name>
            <description>Unspecified</description>
            <headerStructName>TDM_PCGCS_BRGSCK</headerStructName>
            <access>read-write</access>
            <addressOffset>0x200</addressOffset>
            <register>
              <dim>0x3</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>PENALTY[%s]</name>
              <description>Description collection: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0] address overlaps the PENALTY0 address and register description for PENALTY[0] is not valid.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFC</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PENALTY</name>
                  <description>Penalty level</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PENALTY0</name>
              <description>Penalty level for power/clock pair 0. The register description is valid only when FULL_PCP_ZERO feature is not supported</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <alternateRegister>PENALTY[%s]</alternateRegister>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PENALTY</name>
                  <description>Penalty level</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x3</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>FORCEOVERRIDE[%s]</name>
              <description>Description collection: Force override of power/clock pair n.</description>
              <addressOffset>0x80</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CLOCKFORCINGPRE</name>
                  <description>CLOCKFORCINGPRE</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>DOFORCECLOCKPRE</name>
                  <description>DOFORCECLOCKPRE</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>POWERFORCINGPRE</name>
                  <description>POWERFORCINGPRE</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                </field>
                <field>
                  <name>DOFORCEPOWERPRE</name>
                  <description>DOFORCEPOWERPRE</description>
                  <lsb>15</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>DMARX</name>
            <description>Unspecified</description>
            <headerStructName>TDM_PCGCS_DMARX</headerStructName>
            <access>read-write</access>
            <addressOffset>0x300</addressOffset>
            <register>
              <dim>0x2</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>PENALTY[%s]</name>
              <description>Description collection: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0] address overlaps the PENALTY0 address and register description for PENALTY[0] is not valid.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFC</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PENALTY</name>
                  <description>Penalty level</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PENALTY0</name>
              <description>Penalty level for power/clock pair 0. The register description is valid only when FULL_PCP_ZERO feature is not supported</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <alternateRegister>PENALTY[%s]</alternateRegister>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PENALTY</name>
                  <description>Penalty level</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x2</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>FORCEOVERRIDE[%s]</name>
              <description>Description collection: Force override of power/clock pair n.</description>
              <addressOffset>0x80</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CLOCKFORCINGPRE</name>
                  <description>CLOCKFORCINGPRE</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>DOFORCECLOCKPRE</name>
                  <description>DOFORCECLOCKPRE</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>POWERFORCINGPRE</name>
                  <description>POWERFORCINGPRE</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                </field>
                <field>
                  <name>DOFORCEPOWERPRE</name>
                  <description>DOFORCEPOWERPRE</description>
                  <lsb>15</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>DMATX</name>
            <description>Unspecified</description>
            <headerStructName>TDM_PCGCS_DMATX</headerStructName>
            <access>read-write</access>
            <addressOffset>0x400</addressOffset>
            <register>
              <dim>0x2</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>PENALTY[%s]</name>
              <description>Description collection: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0] address overlaps the PENALTY0 address and register description for PENALTY[0] is not valid.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFC</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PENALTY</name>
                  <description>Penalty level</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PENALTY0</name>
              <description>Penalty level for power/clock pair 0. The register description is valid only when FULL_PCP_ZERO feature is not supported</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <alternateRegister>PENALTY[%s]</alternateRegister>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PENALTY</name>
                  <description>Penalty level</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x2</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>FORCEOVERRIDE[%s]</name>
              <description>Description collection: Force override of power/clock pair n.</description>
              <addressOffset>0x80</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CLOCKFORCINGPRE</name>
                  <description>CLOCKFORCINGPRE</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>DOFORCECLOCKPRE</name>
                  <description>DOFORCECLOCKPRE</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>POWERFORCINGPRE</name>
                  <description>POWERFORCINGPRE</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                </field>
                <field>
                  <name>DOFORCEPOWERPRE</name>
                  <description>DOFORCEPOWERPRE</description>
                  <lsb>15</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
