ankuns/nrfx/bsp/stable/mdk/nrf7140_flpr.svd
        <register>
          <name>UARTADDRESS</name>
          <description>Set address for RX (when UART frame size is 9)</description>
          <addressOffset>0x580</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>UART address in 9b mode</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTFRAMETIMEOUT</name>
          <description>Number of symbol periods before timeout</description>
          <addressOffset>0x584</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIMEOUT</name>
              <description>Number of symbol periods before timeout</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARXADDR</name>
          <description>DMA access  buffer RAM start address</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMARXSTARTADDRESS</name>
              <description>DMA access  buffer RAM start address</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARXBUFFERSIZE</name>
          <description>Byte count to receive in Dma Rx operation</description>
          <addressOffset>0x604</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMARXBUFFERSIZE</name>
              <description>Byte count to receive in Dma Rx operation</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARXBYTECOUNT</name>
          <description>Byte count received in latest Dma Rx operation</description>
          <addressOffset>0x608</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMARXBYTECOUNT</name>
              <description>Byte count received in latest Dma Rx operation</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARXENABLE</name>
          <description>Enable for rx dma</description>
          <addressOffset>0x60C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMARXENABLE</name>
              <description>Enable for rx dma</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARXSELECTLIST</name>
          <description>Rx select address from list</description>
          <addressOffset>0x610</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMARXSELECTLIST</name>
              <description>Select address from list</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATXADDR</name>
          <description>Start address for DMA access in buffer RAM</description>
          <addressOffset>0x700</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMATXSTARTADDRESS</name>
              <description>Start address for DMA access in buffer RAM</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATXBUFFERSIZE</name>
          <description>Byte count to transmit in Dma Rx operation</description>
          <addressOffset>0x704</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMATXBUFFERSIZE</name>
              <description>Byte count to transmit in Dma Tx operation</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATXBYTECOUNT</name>
          <description>Byte count transmitted in latest Dma Tx operation</description>
          <addressOffset>0x708</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMATXBYTECOUNT</name>
              <description>Byte count transmitted in latest Dma Tx operation</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATXENABLE</name>
          <description>Enable for rx dma</description>
          <addressOffset>0x70C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMATXENABLE</name>
              <description>Enable for rx dma</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATXSELECTLIST</name>
          <description>Tx select address from list</description>
          <addressOffset>0x710</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMATXSELECTLIST</name>
              <description>Select address from list</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
